
Feature:   Запазване на час при зъболекар -> гостин.

  
  Scenario Outline: Запазване на час при зъболекар
    Given Потребителя отваря екрана за запазване на час
    When Потребителя въведе "<име>"
    And Потребителя сложи "<email>"
    And Потребителя сложи идентификационнен номер за своя час "<идентификация>"
    And Избере потребителя датум: "<дата>" за часа 
    And Избере потребителя време: "<час>" за часа
    And Натисне бутона за запазване на час
    Then Вижда съобщение :"<Съобщение>".
    Examples: 
   |  име  |      email     | идентификация | 		дата     |  час   |         Съобщение                                   |
   | Алекс | alex123@abv.bg | 2320          | 02.02.2022   |  15:30 | Успешно запазихте час, потвърдете чрез вашия е-майл!|
   | Алекс | alex123@abv.bg | 2320          |              |  15:30 | Изберете дата                                       |
   | Алекс | alex123@abv.bg | 2320          | 02.02.2022   |        | Изберете час                                        |
   | Алекс | alex123@abv.bg | 2320          | 02.02.1995   |  15:30 | Изберете валидна дата                               |
   | Алекс | alex123@abv.bg |               | 02.02.2022   |  15:30 | Въведете идентификационнен номер                    |
   | Алекс | alex123@abv.bg | 2             | 02.02.2022   |  15:30 | Идентификацията трябва да е мин. четири символа     |
   | Алекс | alex123@abv.bg | 1111          | 15.02.2022   |  10:30 | Часа е зает!                                        | 
   | Алекс | abv.bg         | 2320          | 02.02.2022   |  15:30 | Въведете валиден емаил!                             |
   | Алекс |                | 2320          | 02.02.2022   |  15:30 | Въведете валиден емаил!                             |
   
   
      
