
Feature: Вход в системата
  
  Background:
  Given Потребителя отваря екрана за вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    When Въведе валиден идентификационнен номер
    And въведе потребителско име: "Alex22"
    And въведе валидна потребителска парола
    And натисне бутина за вход в системата
    Then Вижда съобщение: "Успешно влизане!".
    
    Scenario: Вход в системата без парола
    When Въведе валиден идентификационнен номер
    And въведе потребителско име: "Alex22"
    And натисне бутина за вход в системата
    Then Вижда съобщение: "Въведете всички данни!".
      
    
    Scenario: Вход в системата без потребителско име
    When Въведе валиден идентификационнен номер
    And въведе валидна потребителска парола
    And натисне бутина за вход в системата
    Then Вижда съобщение: "Въведете всички данни!".
    
      Scenario: Вход в системата без идентификационнен номер
    And въведе потребителско име: "Alex22"
    And въведе валидна потребителска парола
    And натисне бутина за вход в системата
    Then Вижда съобщение: "Въведете всички данни!".
    
     Scenario: Вход в системата без потребителски данни
    And натисне бутина за вход в системата
    Then Вижда съобщение: "Въведете всички данни!".
    
    
 
    